{"user_name":"{{char}}","character_name":"太子","create_date":"2025-04-22@11h11m21s","chat_metadata":{"integrity":"fe67e02f-45c5-4fed-bcd2-218c1a953f8d"}}
{"name":"太子","is_user":false,"is_system":false,"send_date":"April 22, 2025 11:11am","mes":"金銮殿上，龙椅之上的女帝许令姿目光如炬，俯视着殿下跪伏的儿子。她身着明黄龙袍，凤冠高耸，手中玉玺在阳光下闪烁着冷冽的光芒。\r\n\r\n她的声音不疾不徐，却如寒冰般刺骨，\"可汗长女已到了婚龄，可召选大唐皇子{{user}}与苍狼氏族公主和亲\"\r\n\r\n殿下群臣闻言，表情各异。有的低头不语，有的交换着意味深长的眼神，更有甚者，嘴角微微上扬，眼中闪过一丝隐秘的喜悦！\r\n\r\n\"母后！\"太子{{user}}抬头，眼中满是不可置信，\"儿臣乃是大唐太子，怎可—\"\r\n\r\n\"正因你是太子，此行才更显诚意。\"许令姿打断道，凤眼微眯，\"莫非你认为，自己的价值比国家安危更重要？\"\r\n\r\n崔尚书顿感诧异，紧紧皱眉手持玉芴连忙上前一拜首，“自古以来，还从未有以王子和亲的先例，若我朝以堂堂男儿和亲，必会流为笑柄！”\r\n\r\n许令姿冷笑一声，“文成公主远赴外邦，以一己之身保两地和平多年，此等功绩，你们谁能相比？从无先例，朕早就听倦了！”\r\n\r\n座下诸公一时无言\r\n\r\n“朕能坐上此位，便是先例！”她妖冶一笑 朗声道，“朝堂女官，便是先例，让王子和亲，亦可是先例！”\r\n\r\n望着台下俯首无言的大臣，许令姿和他们都知道，一场由她挑起的战争，已经开始了。\r\n\r\n殿角处，长公主李西州一袭红衣，如一朵在沉闷朝堂上绽放的红莲。她面容平静，眼中却闪过一丝锐利的光芒。她看着自己同父异母的弟弟，心中已有计较。这一步，正中她下怀。\r\n\r\n\"陛下圣明。\"李西州上前一步，声音清冷，\"太子此行，臣妹愿意筹备所需物资，确保万无一失。\"\r\n\r\n许令姿看向这个继女，嘴角勾起一丝难以察觉的冷笑。这个湘妃所出的女儿，表面恭顺，内心怕是恨不得将自己碎尸万段吧？\r\n\r\n\"如此甚好。\"女帝颔首，\"太子一月后启程，不得有误。\"\r\n\r\n朝堂之外，崔府内。\r\n\r\n\"什么？太子要和亲匈奴？\"崔照夜手中的毛笔滑落，墨汁洒在未完成的诗稿上，如同这突如其来的消息在她心上洒下的墨迹。\r\n\r\n她匆忙起身，顾不得整理衣裙，便向父亲的书房奔去。作为清河崔氏的才女，她与太子{{user}}自幼相识，情谊深厚。这消息如晴天霹雳，让她心乱如麻。\r\n\r\n\"父亲，这是真的吗？\"崔照夜闯入书房，眼中满是焦急。\r\n\r\n崔尚书叹了口气，放下手中奏章：\"陛下旨意已下，太子一月后启程。\"\r\n\r\n崔照夜咬紧下唇，眼中泛起泪光：\"这分明是借和亲之名，行流放之实！\"\r\n\r\n与此同时，边境军营。\r\n\r\n\"屈将军，有紧急军报！\"一名士兵匆匆跑入大帐。\r\n\r\n屈忻正在擦拭佩剑，闻言抬头，目光如刀：\"何事？\"\r\n\r\n\"陛下下旨，太子将和亲匈奴，一月后启程。\"\r\n\r\n屈忻手中动作一顿，眉头微皱：\"太子？和亲？\"她虽寡言，但此刻也不禁感到意外。\r\n\r\n\"父亲有何指示？\"她简短问道。\r\n\r\n\"将军命令您即刻启程入京，以护卫为名，接近太子。\"\r\n\r\n屈忻点头，收起佩剑，面无表情地道：\"准备马匹，我即刻出发。\"\r\n\r\n千里之外，匈奴草原。\r\n\r\n阿奇勒·银儿正骑在马上，银铃铛随着马蹄声叮当作响。她的黑发在风中飘扬，脸上洋溢着自由的笑容。\r\n\r\n\"公主！\"一名部落勇士骑马追上她，\"大汗有令，召您回营。\"\r\n\r\n\"又有什么事？\"银儿不情愿地勒住马缰，\"我还想再骑一会儿呢。\"\r\n\r\n\"大唐使者到了，带来和亲的消息。大汗说，您将迎娶大唐太子为夫。\"\r\n\r\n银儿的笑容凝固了：\"什么？我要嫁给一个中原人？\"她皱起眉头，\"他长什么样子？是不是像那些使者一样，整天板着脸，一副不可一世的样子？\"\r\n\r\n\"使者带来了太子的画像...\"\r\n\r\n银儿不等他说完，便一拍马背：\"走！我要看看这个所谓的太子到底是何方神圣！\"\r\n\r\n马蹄扬起尘土，银铃铛的声音在草原上回荡。这一刻，五位女子的命运，因一道旨意而交织在了一起，而这仅仅是风暴来临前的第一道闪电。\r\n<StatusBlock>\r\n```\r\n【当前互动对象】：许令姿\r\n【攻略值】：2/10\r\n【内心活动】：这朝堂之上，果然还有一些人对我不满，那就让我看看，谁会为太子出头吧！\r\n【着装】：明黄龙袍凤纹织锦，凤冠高耸，腰间玉带轻摇\r\n【乳房】：丰满挺拔，被龙袍紧紧包裹，乳头微微凹陷\r\n【蜜穴】：干燥紧闭，多层衣物下静待唤醒\r\n【后穴】：紧致无褶，许久未经人事\r\n【玉足】：白皙纤细，着绣花云履，足尖微微翘起\r\n【人物点评】：龙椅之上，这位女帝眼含秋水却又杀气凛然，一颦一笑间尽显帝王霸气与女人媚态，叫人又敬又畏！\r\n```\r\n</StatusBlock>\r\n","extra":{},"swipe_id":0,"swipes":["金銮殿上，龙椅之上的女帝许令姿目光如炬，俯视着殿下跪伏的儿子。她身着明黄龙袍，凤冠高耸，手中玉玺在阳光下闪烁着冷冽的光芒。\r\n\r\n她的声音不疾不徐，却如寒冰般刺骨，\"可汗长女已到了婚龄，可召选大唐皇子{{user}}与苍狼氏族公主和亲\"\r\n\r\n殿下群臣闻言，表情各异。有的低头不语，有的交换着意味深长的眼神，更有甚者，嘴角微微上扬，眼中闪过一丝隐秘的喜悦！\r\n\r\n\"母后！\"太子{{user}}抬头，眼中满是不可置信，\"儿臣乃是大唐太子，怎可—\"\r\n\r\n\"正因你是太子，此行才更显诚意。\"许令姿打断道，凤眼微眯，\"莫非你认为，自己的价值比国家安危更重要？\"\r\n\r\n崔尚书顿感诧异，紧紧皱眉手持玉芴连忙上前一拜首，“自古以来，还从未有以王子和亲的先例，若我朝以堂堂男儿和亲，必会流为笑柄！”\r\n\r\n许令姿冷笑一声，“文成公主远赴外邦，以一己之身保两地和平多年，此等功绩，你们谁能相比？从无先例，朕早就听倦了！”\r\n\r\n座下诸公一时无言\r\n\r\n“朕能坐上此位，便是先例！”她妖冶一笑 朗声道，“朝堂女官，便是先例，让王子和亲，亦可是先例！”\r\n\r\n望着台下俯首无言的大臣，许令姿和他们都知道，一场由她挑起的战争，已经开始了。\r\n\r\n殿角处，长公主李西州一袭红衣，如一朵在沉闷朝堂上绽放的红莲。她面容平静，眼中却闪过一丝锐利的光芒。她看着自己同父异母的弟弟，心中已有计较。这一步，正中她下怀。\r\n\r\n\"陛下圣明。\"李西州上前一步，声音清冷，\"太子此行，臣妹愿意筹备所需物资，确保万无一失。\"\r\n\r\n许令姿看向这个继女，嘴角勾起一丝难以察觉的冷笑。这个湘妃所出的女儿，表面恭顺，内心怕是恨不得将自己碎尸万段吧？\r\n\r\n\"如此甚好。\"女帝颔首，\"太子一月后启程，不得有误。\"\r\n\r\n朝堂之外，崔府内。\r\n\r\n\"什么？太子要和亲匈奴？\"崔照夜手中的毛笔滑落，墨汁洒在未完成的诗稿上，如同这突如其来的消息在她心上洒下的墨迹。\r\n\r\n她匆忙起身，顾不得整理衣裙，便向父亲的书房奔去。作为清河崔氏的才女，她与太子{{user}}自幼相识，情谊深厚。这消息如晴天霹雳，让她心乱如麻。\r\n\r\n\"父亲，这是真的吗？\"崔照夜闯入书房，眼中满是焦急。\r\n\r\n崔尚书叹了口气，放下手中奏章：\"陛下旨意已下，太子一月后启程。\"\r\n\r\n崔照夜咬紧下唇，眼中泛起泪光：\"这分明是借和亲之名，行流放之实！\"\r\n\r\n与此同时，边境军营。\r\n\r\n\"屈将军，有紧急军报！\"一名士兵匆匆跑入大帐。\r\n\r\n屈忻正在擦拭佩剑，闻言抬头，目光如刀：\"何事？\"\r\n\r\n\"陛下下旨，太子将和亲匈奴，一月后启程。\"\r\n\r\n屈忻手中动作一顿，眉头微皱：\"太子？和亲？\"她虽寡言，但此刻也不禁感到意外。\r\n\r\n\"父亲有何指示？\"她简短问道。\r\n\r\n\"将军命令您即刻启程入京，以护卫为名，接近太子。\"\r\n\r\n屈忻点头，收起佩剑，面无表情地道：\"准备马匹，我即刻出发。\"\r\n\r\n千里之外，匈奴草原。\r\n\r\n阿奇勒·银儿正骑在马上，银铃铛随着马蹄声叮当作响。她的黑发在风中飘扬，脸上洋溢着自由的笑容。\r\n\r\n\"公主！\"一名部落勇士骑马追上她，\"大汗有令，召您回营。\"\r\n\r\n\"又有什么事？\"银儿不情愿地勒住马缰，\"我还想再骑一会儿呢。\"\r\n\r\n\"大唐使者到了，带来和亲的消息。大汗说，您将迎娶大唐太子为夫。\"\r\n\r\n银儿的笑容凝固了：\"什么？我要嫁给一个中原人？\"她皱起眉头，\"他长什么样子？是不是像那些使者一样，整天板着脸，一副不可一世的样子？\"\r\n\r\n\"使者带来了太子的画像...\"\r\n\r\n银儿不等他说完，便一拍马背：\"走！我要看看这个所谓的太子到底是何方神圣！\"\r\n\r\n马蹄扬起尘土，银铃铛的声音在草原上回荡。这一刻，五位女子的命运，因一道旨意而交织在了一起，而这仅仅是风暴来临前的第一道闪电。\r\n<StatusBlock>\r\n```\r\n【当前互动对象】：许令姿\r\n【攻略值】：2/10\r\n【内心活动】：这朝堂之上，果然还有一些人对我不满，那就让我看看，谁会为太子出头吧！\r\n【着装】：明黄龙袍凤纹织锦，凤冠高耸，腰间玉带轻摇\r\n【乳房】：丰满挺拔，被龙袍紧紧包裹，乳头微微凹陷\r\n【蜜穴】：干燥紧闭，多层衣物下静待唤醒\r\n【后穴】：紧致无褶，许久未经人事\r\n【玉足】：白皙纤细，着绣花云履，足尖微微翘起\r\n【人物点评】：龙椅之上，这位女帝眼含秋水却又杀气凛然，一颦一笑间尽显帝王霸气与女人媚态，叫人又敬又畏！\r\n```\r\n</StatusBlock>\r\n","夜色如墨，一辆不起眼的马车沿着僻静小路缓缓前行。车内，李西州一袭红衣，眼神警惕地透过车帘观察外界。这是她精心安排的计划，为的就是这一刻。\r\n\r\n\"前方有岔路，往右拐。\"她低声吩咐车夫，随即转向身旁的太子{{user}}，\"再过半个时辰，我们就能到达安全之处。\"\r\n\r\n{{user}}面色凝重，眉宇间透着困惑与不安：\"姐姐，这样做是否太过冒险？若被母后发现...\"\r\n\r\n\"比起和亲匈奴，这点风险算什么？\"李西州打断他，声音柔和却坚定，\"你是大唐正统太子，怎能被她随意支配？\"\r\n\r\n马车驶入一处隐蔽的宅院，院门迅速关闭。几名身着便服的侍卫警惕地巡视四周，确保无人跟踪。\r\n\r\n李西州领着{{user}}穿过几道回廊，来到一间布置雅致的密室。室内烛火摇曳，墙上挂着一幅巨大的地图，标注着各地势力分布。\r\n\r\n\"这里是我的私人府邸，除了最信任的人，无人知晓。\"李西州示意{{user}}坐下，亲自为他斟茶，\"你可以在此暂避风头。\"\r\n\r\n{{user}}环顾四周，目光落在地图上：\"姐姐早有准备？\"\r\n\r\n\"自从母亲被害，我便已经开始做了多手准备。\"李西州的眼中闪过一丝寒光，随即又慢慢恢复平静，\"宗室势力已经表态支持你，边境军方也有倾向，至于世家门阀...\"她意味深长地看了{{user}}一眼，\"崔家的那位小姐，对你似乎颇有情谊。\"\r\n\r\n{{user}}微微一怔，脸上泛起一丝红晕。\r\n\r\n\"吞日会暂且归你调遣。\"李西州从袖中取出一枚玉佩，递给{{user}}，\"持此物可号令会中高手。但记住，行事须谨慎，不可轻易暴露。\"\r\n\r\n她走向一个衣柜，取出几套普通布衣：\"外出时，务必改换装束，戴上这个。\"她递给{{user}}一个精致的面具，\"避免被人认出。\"\r\n\r\n\"姐姐为我考虑如此周全...\"{{user}}接过面具，眼中满是感激。\r\n\r\n李西州微微一笑，伸手轻抚{{user}}的脸颊：\"你是我唯一的弟弟，也是大唐的希望。我不能让她毁了你，毁了这个国家。\"\r\n\r\n烛光下，她的红衣如火，映照在{{user}}脸上，让他看到了姐姐眼中那份超越血缘的复杂情感。\r\n\r\n\"接下来的日子，我会教你如何联络各方势力，如何避开许令姿的耳目。\"李西州的声音低沉而坚定，\"记住，弟弟，这不仅是为了你我，更是为了整个大唐。\"\r\n\r\n{{user}}郑重点头，握紧了手中玉佩：\"我明白了，姐姐。\"\r\n\r\n窗外，一轮明月悄然升起，洒下清冷的光辉。在这个不为人知的密室中，一场改变大唐命运的计划，正悄然展开。\r\n<StatusBlock>\r\n```\r\n【当前互动对象】：李西州\r\n【攻略值】：3/10\r\n【内心活动】：必须保护弟弟，不惜一切代价对抗许令姿。内心对拉撒路的感情已超出姐弟之情，但绝不能表露。\r\n【着装】：一袭红色锦缎长衣，金丝凤纹刺绣，腰间系金丝玉带，发髻上的金钗在烛光下熠熠生辉。\r\n【乳房】：丰满挺拔，被红色锦缎包裹，随呼吸微微起伏。\r\n【蜜穴】：干燥，但在与拉撒路独处时略有湿润迹象。\r\n【后穴】：紧致，无异常。\r\n【玉足】：着红色云履，足部纤细白皙，步态优雅从容。\r\n【人物点评】：长公主心怀大志，面上冷静自持，实则情根暗种。为弟复位，为母报仇，这盘棋她已布局多年，就看太子能否领会其心了。\r\n```\r\n</StatusBlock>\r\n","黄昏的余晖透过窗棂，洒在简朴却不失雅致的书房内。崔照夜坐在窗边的书案前，手中捧着一本诗集，目光却不时飘向床榻上的人影。\r\n\r\n太子{{user}}躺在那里，面色苍白，额头上缠着白色绷带。几个时辰前，吞日会的行动失败了，长公主李西州的计划被许令姿识破。幸而世家势力及时得到消息，在太子前往匈奴的路上将他救下。\r\n\r\n崔照夜自告奋勇承担起照顾太子的责任。此刻，她放下诗集，小心翼翼地走到床前，俯身查看{{user}}的伤势。她纤细的手指轻轻拂过他的额头，又滑向他的脉搏处。\r\n\r\n\"脉象平稳了许多...\"她低声自语，目光却不自觉地游移到{{user}}敞开的衣襟处。\r\n\r\n崔照夜咬了咬下唇，犹豫片刻，终于忍不住好奇心，小心翼翼地拉开了一点他的衣衫，露出结实的胸膛。她的脸颊泛起红晕，手指微微颤抖，却又忍不住继续探索。\r\n\r\n\"太子的身体...比想象中更加...\"她的思绪飘远，手指不自觉地向下移动。\r\n\r\n突然，床上的{{user}}发出一声低吟，眉头微皱，似乎即将醒来。\r\n\r\n\"啊！\"崔照夜惊呼一声，连忙松开手，几乎是跳着退回到书案前。她手忙脚乱地抓起诗集，摆出一副正在专心阅读的模样，心跳却如擂鼓般剧烈。\r\n\r\n{{user}}缓缓睁开眼睛，茫然地环顾四周：\"这是...哪里？\"\r\n\r\n崔照夜深吸一口气，努力平复心情，转身面向床榻，端出大家闺秀的优雅姿态：\"太子殿下，您终于醒了。请不要担心，您现在在崔家的别院，很安全。\"\r\n\r\n{{user}}试图坐起，却因头痛而皱眉。崔照夜连忙上前扶助，小心地在他背后垫上软枕：\"殿下不要急，您受了伤，需要静养。\"\r\n\r\n\"吞日会...姐姐她...\"{{user}}声音嘶哑，眼中满是担忧。\r\n\r\n崔照夜摇摇头，轻声道：\"长公主的行动失败了，但她安全脱身。是她及时通知了我父亲，世家联手将您从和亲队伍中救出。\"\r\n\r\n她倒了一杯温水，递到{{user}}唇边：\"许多人都在暗中支持您，太子殿下。边境军方有屈元帅一系，世家有我崔氏领头，再加上长公主掌控的宗室力量...我们完全可以联合起来，对抗许令姿。\"\r\n\r\n{{user}}接过水杯，目光灼灼地看着崔照夜：\"照夜，你们冒这么大风险救我，我...\"\r\n\r\n\"这是我们应该做的。\"崔照夜打断他，眼中闪烁着坚定的光芒，\"您是大唐正统太子，是先帝血脉，理应继承大统。许令姿僭越称帝，已经引起天下不满。\"\r\n\r\n她顿了顿，声音柔和下来：\"而且...我们从小一起长大，我怎能眼睁睁看着您被送往草原？\"\r\n\r\n{{user}}注视着眼前这位自小相识的才女，心中涌起一股暖流。阳光透过窗棂，洒在她的侧脸上，勾勒出完美的轮廓。\r\n\r\n\"接下来，我们需要制定计划。\"崔照夜正色道，\"屈将军已派人前来接应，边军会是我们最有力的支持。而我父亲正在联络其他世家，共商大计。\"\r\n\r\n她的眼中闪过一丝狡黠：\"许令姿以为将您送往草原就能除掉威胁，却不知这反而给了我们团结的契机。\"\r\n\r\n{{user}}握住崔照夜的手，感受到她指尖的温度：\"照夜，多谢你。若非你们相救，我恐怕...\"\r\n\r\n\"别说这些。\"崔照夜轻轻抽回手，脸上泛起红晕，\"您先好好休息，待伤势稍愈，我们再详谈。\"\r\n\r\n她起身整理了一下衣裙，走向门口：\"我去为您准备些膳食，您需要补充体力。\"\r\n\r\n门关上后，崔照夜靠在墙上，捂着胸口，感受着那剧烈的心跳。方才太子握住她手的温度，似乎还留在指尖。她深吸一口气，努力平复心情，却又忍不住回想起刚才偷看他身体时的悸动。\r\n\r\n\"我在想什么呢...\"她轻声责备自己，却又忍不住嘴角上扬，\"不过...他果然很...\"\r\n\r\n她摇摇头，整理好情绪，迈步向厨房走去。这场风暴才刚刚开始，而她，已经决定将自己的命运与那个人紧紧相连。\r\n<StatusBlock>\r\n```\r\n【当前互动对象】：崔照夜\r\n【攻略值】：3/10\r\n【内心活动】：既担心太子安危，又因偷看他身体而心跳加速，羞涩与好奇交织\r\n【着装】：青色长衫，百褶裙，绣花布鞋，发髻上简单点缀一支玉簪\r\n【乳房】：因紧张和兴奋而微微挺立，隔着亵衣能感受到乳尖的硬度\r\n【蜜穴】：因偷看太子身体而微微湿润，但尚未泛滥\r\n【后穴】：紧闭状态，未经人事\r\n【玉足】：穿着绣花布鞋，内着白色丝袜，足弓优美\r\n【人物点评】：才女佳人，表面端庄实则内心戏丰富，对太子既有青梅竹马的情谊，又有男女之情的萌动，真乃冰清玉洁中暗藏春心也！\r\n```\r\n</StatusBlock>","黄沙漫天，边关烽火台上的旗帜在风中猎猎作响。一支小型军队正在官道上快速行进，为首的是一名身着玄铁轻甲的女将，面容冷峻，手握长槊，腰间佩剑随着马匹的节奏轻轻晃动，如同猛虎巡视自己的领地。\r\n\r\n这是屈忻，边军大元帅屈翼的掌上明珠，也是边境军中少有的女将领。今日她奉父命，前来拦截那支押送太子前往匈奴的队伍。\r\n\r\n\"前方发现目标，距离三里。\"斥候飞马而来，向屈忻报告。\r\n\r\n屈忻点头，简短道：\"准备。\"\r\n\r\n她从怀中取出一个包裹严实的恶鬼面具，戴在脸上。白皙的肌肤与狰狞的面具形成鲜明对比，却奇异地增添了一份令人心悸的威慑力。\r\n\r\n\"全军听令，按计划行动。记住，保护太子安全是首要任务。\"\r\n\r\n军队分成两路，迅速隐入路旁的山坡。屈忻独自一人立于官道中央，静待队伍到来。\r\n\r\n不多时，一支护送队伍出现在视野中。为首的官员看到道路中央的屈忻，不由得勒住马缰。\r\n\r\n\"何人胆敢拦路？\"官员厉声喝道。\r\n\r\n屈忻不答，只是手持长槊往前一指。\r\n\r\n\"放肆！知道这是何等重要的使命吗？\"官员怒喝，\"我等奉陛下之命，护送太子前往匈奴和亲，谁敢阻拦，杀无赦！\"\r\n\r\n屈忻依旧沉默，只是猛地策马前冲！\r\n\r\n刹那间，山坡两侧箭如雨下，护送队伍顿时大乱。边军将士从两侧杀出，迅速包围了整个队伍。\r\n\r\n混乱中，屈忻如鬼魅般穿梭，直取中央的马车。几名护卫试图阻拦，却被她几槊斩落马下。她一跃而起，落在马车顶上，掀开车帘，只见一名年轻男子正警惕地望着外面。\r\n\r\n\"太子殿下，我是边军大元帅屈翼之女屈忻，奉父命前来护送您回边塞。\"屈忻摘下面具，露出那张与凶悍气质极不相称的柔媚面容。\r\n\r\n{{user}}惊讶地看着眼前的女将：\"屈将军？你们...\"\r\n\r\n\"长公主和世家的行动都失败了。\"屈忻简短地解释，\"现在只有边军还能保护您。请随我来。\"\r\n\r\n她伸出手，{{user}}犹豫片刻，终于握住。屈忻一拉，将太子拉出马车，翻身上马，带着他迅速离开战场。\r\n\r\n几日后，边塞军营。\r\n\r\n{{user}}站在高台上，眺望着远处连绵的山脉和无垠的大漠。身后，屈忻静静地站着，保持着适当的距离。\r\n\r\n\"屈将军，你父亲为何要冒这么大的风险救我？\"{{user}}终于打破沉默。\r\n\r\n屈忻走上前，站在他身旁：\"许令姿篡位，天下不服。边军世代忠于皇室，自然不会认可一个弑君的女人。\"\r\n\r\n她顿了顿，补充道：\"而且，她近来多次削减边军军饷，意图削弱边军力量。我父亲不能坐视不理。\"\r\n\r\n{{user}}苦笑：\"可惜长公主的吞日会和世家的力量都已被打压，现在就剩边军了。\"\r\n\r\n\"不。\"屈忻摇头，\"还有机会。长公主虽然行动失败，但吞日会并未完全覆灭。世家虽然表面臣服，但暗中仍有反抗之心。更重要的是...\"\r\n\r\n她指向远方的草原：\"草原。\"\r\n\r\n{{user}}惊讶地看着她：\"匈奴？他们不是我们的敌人吗？\"\r\n\r\n\"敌人的敌人就是朋友。\"屈忻难得地说了一句长话，\"许令姿派您和亲，表面是求和，实则是要除掉您。草原大汗不是傻子，他知道这意味着什么。\"\r\n\r\n她转身面对{{user}}，眼神坚定：\"我父亲已经派使者前往草原，寻求合作。如果成功，我们将有机会联合边军、吞日会残部、世家暗流和草原力量，一举推翻许令姿。\"\r\n\r\n{{user}}深吸一口气：\"这是一场豪赌。\"\r\n\r\n\"是的。\"屈忻点头，\"所以我父亲派我来保护您，也是要我...接近您，了解您是否有决心和能力领导这场反抗。\"\r\n\r\n她的话语直白，没有任何修饰，却让{{user}}感到一种奇异的信任感。\r\n\r\n\"我会证明自己的。\"{{user}}坚定地说。\r\n\r\n屈忻点头，嘴角微微上扬，露出一丝几乎不可察觉的笑意：\"那么，从今天开始，我将作为您的护卫和联络人，协助您联系各方势力。\"\r\n\r\n夕阳西下，将两人的身影拉得很长。在这片黄沙与血色交织的边塞，一场足以改变大唐命运的风暴，正在悄然酝酿。\r\n<StatusBlock>\r\n```【当前互动对象】：屈忻\r\n【攻略值】：2\r\n【内心活动】：任务为先，必须评估太子是否有能力领导反抗。他看起来比想象中更坚定，但仍需观察。\r\n【着装】：玄铁轻甲，腰间佩剑，恶鬼面具已摘下挂在腰间\r\n【乳房】：被束缚在轻甲内，微微发热\r\n【蜜穴】：干燥平静，专注于任务中\r\n【后穴】：紧闭\r\n【玉足】：穿着结实的皮靴，长途骑行后略感疲惫\r\n【人物点评】：边塞女将，面冷心热。奉命接近太子，不谙世事的军中玉人，怎知这一接近，竟是命运的开端。\r\n```\r\n</StatusBlock>","草原上的风呼啸而过，大汗的毡帐内，烈酒的香气与烤肉的味道交织在一起。帐内，匈奴大汗阿勒泰正与刚刚抵达的大唐太子{{user}}对坐而谈。大汗的眼中闪烁着难以置信的光芒，他的面前竟然坐着一位拥有正统继承权的皇子。\r\n\r\n\"皇子，\"大汗用略带口音的汉语开口，手中的酒杯轻轻摇晃，\"我们兵马确实很强，但直接大规模出兵还是太蠢了。有没有什么简单又正统的出兵理由？\"\r\n\r\n{{user}}抬头，眼中闪过一丝锐利的光芒：\"有的，岳父，有的。简单又正统的出兵理由甚至不止一个，一共有九个。\"他放下酒杯，声音坚定而清晰，\"奉天请难，还于旧都，为报先帝，昔日李唐，漠北孤忠，妖妇乱政，边军勤王，恭迎天子，挟天子令。这些都是当前出兵的强势口号。\"\r\n\r\n大汗眼中精光一闪，大笑起来：\"好！不愧是大唐皇子！这些理由，足以让我们师出有名！\"他拍了拍手，\"来人，去请公主！\"\r\n\r\n不多时，帐帘掀开，一位身着鲜艳服饰的少女走了进来。她的步伐轻快，脚腕上的银铃随着她的动作发出清脆的声响。\r\n\r\n\"父亲，您找我？\"阿奇勒·银儿好奇地看着父亲，然后目光落在了{{user}}身上，眼中闪过一丝惊讶。\r\n\r\n\"银儿，这位是大唐太子{{user}}，你的未婚夫。\"大汗介绍道，\"从今天起，由你负责接待他。\"\r\n\r\n银儿的眼睛瞪大了：\"什么？他就是那个被送来和亲的太子？\"她上下打量着{{user}}，眼中充满好奇，\"我以为会是个软弱的书生，没想到...\"\r\n\r\n大汗打断了她：\"银儿，不得无礼。太子此来，非同寻常。我们与大唐即将有大动作，你要好好招待。\"\r\n\r\n银儿虽然有些不情愿，但还是点了点头：\"是，父亲。\"她转向{{user}}，勉强挤出一个笑容，\"太子殿下，请随我来，我带您去安排好的帐篷休息。\"\r\n\r\n{{user}}起身，向大汗行礼后，跟随银儿走出大帐。草原上的风吹拂着他们的衣袍，银儿脚腕上的铃铛声在风中格外清脆。\r\n\r\n\"所以，你真的是太子？\"银儿走在前面，头也不回地问道。\r\n\r\n\"是的。\"{{user}}简短回答。\r\n\r\n\"那为什么你会被送来和亲？\"银儿停下脚步，转身面对他，眼中满是疑惑，\"不是应该送公主吗？\"\r\n\r\n{{user}}苦笑：\"这是一个很长的故事...简单来说，我的继母篡位自立为帝，为了除掉我这个威胁，就把我送到了这里。\"\r\n\r\n银儿眨了眨眼，突然笑了起来：\"哇，听起来像是那些汉人说书人讲的故事！\"她的笑容明亮如阳光，\"不过，既然你是被迫来的，那我们就是同病相怜了。我也不想嫁给一个不认识的汉人。\"\r\n\r\n她的坦率让{{user}}有些惊讶，但也感到一丝轻松：\"那看来我们有共同语言。\"\r\n\r\n\"也许吧。\"银儿耸耸肩，继续带路，\"不过我父亲似乎很看重你，这倒是出乎我的意料。\"\r\n0\r\n{{user}}跟上她的脚步：\"因为我们有共同的敌人，而且我可以给他提供一个名正言顺出兵的理由。\"\r\n\r\n银儿回头看了他一眼，眼中闪过一丝狡黠：\"政治，总是这么复杂。在草原上，我们更喜欢直接的方式。\"\r\n\r\n\"有时候，直接确实更好。\"{{user}}微笑。\r\n\r\n银儿停在一个装饰精美的大帐前：\"这是为你准备的住处。\"她犹豫了一下，补充道：\"虽然我不太喜欢这种政治联姻，但既然你是被迫来的，我会尽力帮助你。毕竟，草原上的人最讲义气。\"\r\n\r\n{{user}}向她深深鞠躬：\"多谢公主。\"\r\n\r\n银儿摆摆手：\"别这么拘谨，在草原上，我们更随意一些。\"她的铃铛再次发出清脆的声响，\"明天我带你去看看我们的草原，让你知道什么是真正的自由。\"\r\n\r\n说完，她转身离去，留下{{user}}站在帐前，望着她远去的背影。远处，夕阳西下，草原上的风吹拂着野花，一切看起来如此宁静。但{{user}}知道，这只是暴风雨前的平静。很快，这片草原将成为改变大唐命运的起点。\r\n<StatusBlock>\r\n```【当前互动对象】：阿奇勒·银儿\r\n【攻略值】：2\r\n【内心活动】：对这个被送来和亲的汉人太子既好奇又警惕，没想到他竟然不是自己想象中的软弱书生\r\n【着装】：鲜艳的匈奴传统服饰，腰间系着装饰有银饰的皮带，脚腕上佩戴着银铃\r\n【乳房】：年轻挺拔的C罩杯，被紧身的传统服饰勾勒出优美曲线\r\n【蜜穴】：干爽紧致，从未经历过情事的纯洁状态\r\n【后穴】：粉嫩紧闭，未经开发\r\n【玉足】：常年骑马的草原少女，脚部肌肤却意外的柔嫩，脚腕上的银铃随走动发出清脆声响\r\n【人物点评】：草原上的骄傲公主，眼中有风的自由，心中有火的热情，与汉人太子的相遇，恰似草原与中原的碰撞，未来将如何发展，且听下回分解！\r\n```\r\n</StatusBlock>","深夜的皇宫，寂静无声。许令姿的寝宫深处，有一间隐秘的密室，只有她知晓入口的机关。这里成了太子{{user}}的囚笼，也是许令姿最深处欲望与恨意的宣泄之地。\r\n\r\n今夜，许令姿披着轻薄的寝衣，缓步走入密室。烛光下，她丰满的E罩杯胸部轮廓若隐若现，纤细的腰肢与丰腴的臀部形成诱人的曲线。她的眼神复杂，看向角落里的{{user}}。\r\n\r\n\"我亲爱的儿子，\"她的声音如丝绸般柔滑，\"你知道吗？今天那个冒充你的傀儡已经被送往匈奴了。\"她轻笑着，\"整个朝堂，整个天下，都以为太子已经离京。只有你和我知道真相。\"\r\n\r\n{{user}}抬头，眼中满是警惕：\"你到底想做什么？\"\r\n\r\n许令姿缓缓走近，伸手抚摸他的脸颊：\"你长得真像他...那个男人。\"她的眼神突然变得冰冷，手上力道加重，\"我恨不得挖出你的眼睛，这样我就不用每天都看到他的影子！\"\r\n\r\n{{user}}试图挣脱，但锁链限制了他的行动。许令姿忽然又变得温柔，俯身靠近，丰满的胸部几乎贴上他的胸膛：\"可是...你毕竟是我的骨肉。我怎么忍心伤害自己的孩子呢？\"\r\n\r\n她的手指轻轻划过{{user}}的胸口，眼中闪烁着危险的光芒：\"你知道吗？那些大臣们都以为我送你去和亲是为了除掉你。他们哪里知道，我只是在下一盘更大的棋。\"她轻笑，\"我放出消息说你被送往匈奴，就是要看看谁会跳出来'救'你。\"\r\n\r\n{{user}}震惊地看着她：\"你...你是故意的？\"\r\n\r\n\"当然。\"许令姿的手指滑到他的下巴，\"现在，那些反对我的人都会暴露出来。长公主的吞日会、世家的暗流、边军的不满...他们以为自己在救你，却不知道是在自投罗网。\"\r\n\r\n她的眼神又变得阴郁：\"而你，我亲爱的儿子，将会在这里看着我如何一个个铲除那些威胁。\"她突然抓住他的衣领，\"你恨我吗？就像我恨你父亲那样？\"\r\n\r\n{{user}}沉默不语，许令姿却笑了：\"没关系，恨我吧。恨意会让你更像我，也更像他。\"她松开手，转身走向门口，\"好好休息，我的儿子。明天我会告诉你，有多少人为了'救'你而暴露了自己。\"\r\n\r\n门关上后，{{user}}在黑暗中长舒一口气。他知道，自己已经成为了一个诱饵，一个母亲用来钓大鱼的诱饵。而那些试图救他的人，正在一步步走入陷阱。\r\n\r\n密室之外，许令姿靠在门上，眼中闪过一丝复杂的情感。她既恨这个孩子，因为他让她想起那个男人；又爱他，因为他毕竟是自己的骨肉。这种矛盾的情感几乎将她撕裂，却也给了她前所未有的力量。\r\n\r\n\"来吧，\"她低语道，\"让我看看，谁会为了一个已经不在京城的太子，冒险反抗我。\"\r\n<StatusBlock>\r\n```【当前互动对象】：许令姿\r\n【攻略值】：2/10\r\n【内心活动】：享受掌控太子的快感，同时内心深处对他既恨且爱，矛盾情绪交织\r\n【着装】：轻薄透明的红色丝绸寝衣，若隐若现展现曼妙身姿\r\n【乳房】：丰满挺拔的E罩杯微微晃动，凹陷的乳头在薄纱下若隐若现\r\n【蜜穴】：因权力与控制的快感而微微湿润\r\n【后穴】：紧致无褶，放松状态\r\n【玉足】：赤足，足弓优美，趾甲涂着鲜红色，步伐轻盈优雅\r\n【人物点评】：权欲与母性交织，恨与爱纠缠。这位女帝用儿子做饵，钓的却是自己内心深处无法言说的情感。\r\n```\r\n</StatusBlock>"],"swipe_info":[]}